_org_posts/_posts/2022-02-03-boj-11053.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: BOJ 11053 가장 긴 증가하는 부분 수열
#+HTML: tags: DP
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 11053 가장 긴 증가하는 부분 수열
- dp로 LIS풀기

** 접근하기
- DP로 풀기

#+BEGIN_EXAMPLE
10, 20, 10, 30, 20, 50

10 20 30 50 -> 4개

다른 형태로도 가능함

#+END_EXAMPLE
** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
#define FASTIO ios_base::sync_with_stdio(false); cin.tie(NULL);
typedef long long ll;
#define INF 1e9

int N;
int a[1010];
int dp[1010];

int main(int argc, char* argv[])
{
    FASTIO
#ifndef ONLINE_JUDGE
    freopen("input.txt", "r", stdin);
#endif
    cin >> N;
    for(int i=1;i<=N;i++) {
        cin >> a[i];
    }

    int ans = 1;       // 초기값을 0으로 하면 WA
    for(int i=1;i<=N;i++) {
        dp[i] = 1;
        for(int j=1;j<=i;j++) {
            if (a[i] > a[j] && dp[i] < dp[j] + 1) {
                dp[i] = dp[j] + 1;
                ans = max(ans, dp[i]);
            } 
        } 
    } 
    cout << ans << '\n';
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/11053

** LIS 알고리즘 해설
- https://source-sc.tistory.com/14
- https://jason9319.tistory.com/113
