_posts_bak/2022-02-03-boj-11053.html
---
layout: post
title: BOJ 11053 가장 긴 증가하는 부분 수열
tags: DP
---

<div id="outline-container-org02021bd" class="outline-2">
<h2 id="org02021bd">BOJ 11053 가장 긴 증가하는 부분 수열</h2>
<div class="outline-text-2" id="text-org02021bd">
<ul class="org-ul">
<li>dp로 LIS풀기</li>
</ul>
</div>
</div>

<div id="outline-container-org48dfb6c" class="outline-2">
<h2 id="org48dfb6c">접근하기</h2>
<div class="outline-text-2" id="text-org48dfb6c">
<ul class="org-ul">
<li>DP로 풀기</li>
</ul>

<pre class="example">
10, 20, 10, 30, 20, 50

10 20 30 50 -&gt; 4개

다른 형태로도 가능함

</pre>
</div>
</div>
<div id="outline-container-orgc711771" class="outline-2">
<h2 id="orgc711771">코드</h2>
<div class="outline-text-2" id="text-orgc711771">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[1010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[1010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
<span style="color: #729fcf;">#if</span><span style="color: #729fcf;">n</span><span style="color: #729fcf;">def</span> ONLINE_JUDGE
    <span style="color: #ff6347;">freopen</span>(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
<span style="color: #729fcf;">#endif</span>
    cin &gt;&gt; N;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        cin &gt;&gt; a[i];
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 1;       <span style="color: #888a85;">// </span><span style="color: #888a85;">&#52488;&#44592;&#44050;&#51012; 0&#51004;&#47196; &#54616;&#47732; WA</span>
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        dp[i] = 1;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=1;j&lt;=i;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (a[i] &gt; a[j] &amp;&amp; dp[i] &lt; dp[j] + 1) {
                dp[i] = dp[j] + 1;
                ans = max(ans, dp[i]);
            } 
        } 
    } 
    cout &lt;&lt; ans &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb0c374" class="outline-2">
<h2 id="orgdb0c374">문제 링크</h2>
<div class="outline-text-2" id="text-orgdb0c374">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11053">https://www.acmicpc.net/problem/11053</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8950db" class="outline-2">
<h2 id="orgb8950db">LIS 알고리즘 해설</h2>
<div class="outline-text-2" id="text-orgb8950db">
<ul class="org-ul">
<li><a href="https://source-sc.tistory.com/14">https://source-sc.tistory.com/14</a></li>
<li><a href="https://jason9319.tistory.com/113">https://jason9319.tistory.com/113</a></li>
</ul>
</div>
</div>
